# Add Taps
tap "buo/cask-upgrade"
tap "homebrew/aliases"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "tusharjoshi/tusharjoshi"
tap "wagoodman/dive"

# Add Java dependency
cask "java"

# opensource tools
brew "ag"
brew "ant"
brew "autoenv"
brew "bash-git-prompt"
brew "cctools"
brew "clojure"
brew "ffmpeg"
brew "fzf"
brew "gcc"
brew "gdbm"
brew "gdub"
brew "git"
brew "gmp"
brew "gnutls"
brew "gnupg"
brew "go"
brew "gradle"
brew "graphicsmagick"
brew "guetzli"
brew "openssl"
brew "httrack"
brew "hub"
brew "jenv"
brew "leiningen"
brew "libpng"
brew "mas"
brew "maven"
brew "mpg123"
brew "nvm"
brew "p7zip"
brew "python"
brew "rust"
brew "terminal-notifier"
brew "the_silver_searcher"
brew "sqlite"
brew "thefuck"
brew "tomcat"
brew "tomcat@7"
brew "tomcat@8"
brew "tree"
brew "wget"
brew "wine"
brew "winetricks"
brew "yarn", args: ["without-node"]
brew "youtube-dl"

# opensource apps
cask "adobe-air" #dependency
cask "alfred"
cask "amazon-drive"
cask "android-file-transfer"
cask "android-studio"
cask "anki"
cask "appcleaner"
cask "argouml"
cask "battery-guardian"
cask "caffeine"
cask "calibre"
cask "coolbeans"
cask "cyberduck"
cask "devhub"
cask "discord"
brew "wagoodman/dive/dive"
cask "docker"
cask "dotnet-sdk"
cask "dropbox"
cask "eclipse-jee"
cask "filezilla"
cask "firefox"
cask "flash-npapi"
cask "flux"
cask "font-ibm-plex"
cask "freecad"
cask "freemind"
cask "gas-mask"
cask "gitter"
cask "google-chrome"
cask "google-earth-pro"
cask "handbrake"
cask "handshaker"
cask "iexplorer"
cask "java8"
cask "keka"
cask "kindle"
cask "krita"
cask "lando"
cask "lektor"
cask "lighttable"
cask "little-snitch"
cask "mono-mdk"
cask "netbeans"
cask "ngrok"
cask "nosleep"
cask "omnidisksweeper"
cask "opera"
cask "pencil"
cask "pennywise"
cask "pharo-launcher"
cask "powershell"
cask "skype-for-business"
cask "slack"
cask "soundflower"
cask "spectacle"
cask "virtualbox"
cask "visual-studio-code"
cask "vlc"
cask "wine-stable"
cask "xquartz"
cask "yammer"

# licensed apps
cask "beyond-compare"
cask "camtasia"
cask "duet"
cask "iexplorer"
cask "intellij-idea"
cask "kindle"
cask "little-snitch"
cask "snagit"

# Mac Appstore apps
mas "DaisyDisk", id: 411643860
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "iTranslate", id: 884952790
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Photo Theater Lite", id: 538286002
mas "SHAREit", id: 1040029915
mas "TweetDeck", id: 485812721
mas "UlyssesMac", id: 1225570693
mas "Xcode", id: 497799835
