# Add Taps
tap "buo/cask-upgrade"
tap "caskroom/cask"
tap "homebrew/bundle"
tap "homebrew/core"

# Add Java dependency
cask "java"

# opensource tools
brew "ant"
brew "autoenv"
brew "bash-git-prompt"
brew "cctools"
brew "ffmpeg"
brew "gdbm"
brew "git"
brew "go"
brew "gradle"
brew "guetzli"
brew "openssl"
brew "httrack"
brew "hub"
brew "maven"
brew "node"
brew "p7zip"
brew "sqlite"
brew "python"
brew "tree"
brew "wget"
brew "youtube-dl"

# opensource apps
cask "alfred"
cask "amazon-drive"
cask "android-file-transfer"
cask "android-studio"
cask "anki"
cask "appcleaner"
cask "argouml"
cask "atom"
cask "audiobookbinder"
cask "battery-guardian"
cask "caffeine"
cask "calibre"
cask "cheatsheet"
cask "discord"
cask "dropbox"
cask "eclipse-jee"
cask "filezilla"
cask "firefox"
cask "firefoxdeveloperedition"
cask "flash-npapi"
cask "freemind"
cask "gas-mask"
cask "gitter"
cask "google-chrome"
cask "google-earth-pro"
cask "handbrake"
cask "handshaker"
cask "keka"
cask "lektor"
cask "mindnode-pro"
cask "nosleep"
cask "opera"
cask "pencil"
cask "slack"
cask "sublime-text"
cask "virtualbox"
cask "visual-studio-code"
cask "vlc"
cask "xquartz"

# licensed apps
cask "beyond-compare"
cask "camtasia"
cask "duet"
cask "iexplorer"
cask "intellij-idea"
cask "snagit"
